In [1]:
import os
import pandas as pd
os.chdir("D:\\program\\PYTHON\\CSV")
data=pd.read_csv("csv3.csv")
print(data)

      Name   Age   Salary  Country  Gender Department
0    Alice  25.0  50000.0      USA  Female         HR
1      Bob   NaN  60000.0   Canada    Male         IT
2  Charlie  30.0      NaN      USA    Male    Finance
3    David  22.0  45000.0      NaN    Male         IT
4      Eva   NaN      NaN  Germany  Female         HR
5    Frank  35.0      NaN   Canada    Male         IT
6    Grace  28.0  55000.0      USA  Female    Finance
7     Hank   NaN      NaN  Germany    Male         IT
8      Ivy  31.0      NaN  Germany  Female    Finance
9     Jack  40.0  80000.0      USA    Male         HR

In [2]:
data2=data.copy()
data3=data.copy()
print(data2,"\n\n",data3)

      Name   Age   Salary  Country  Gender Department
0    Alice  25.0  50000.0      USA  Female         HR
1      Bob   NaN  60000.0   Canada    Male         IT
2  Charlie  30.0      NaN      USA    Male    Finance
3    David  22.0  45000.0      NaN    Male         IT
4      Eva   NaN      NaN  Germany  Female         HR
5    Frank  35.0      NaN   Canada    Male         IT
6    Grace  28.0  55000.0      USA  Female    Finance
7     Hank   NaN      NaN  Germany    Male         IT
8      Ivy  31.0      NaN  Germany  Female    Finance
9     Jack  40.0  80000.0      USA    Male         HR

       Name   Age   Salary  Country  Gender Department
0    Alice  25.0  50000.0      USA  Female         HR
1      Bob   NaN  60000.0   Canada    Male         IT
2  Charlie  30.0      NaN      USA    Male    Finance
3    David  22.0  45000.0      NaN    Male         IT
4      Eva   NaN      NaN  Germany  Female         HR
5    Frank  35.0      NaN   Canada    Male         IT
6    Grace  28.0  55000.0      USA  Female    Finance
7     Hank   NaN      NaN  Germany    Male         IT
8      Ivy  31.0      NaN  Germany  Female    Finance
9     Jack  40.0  80000.0      USA    Male         HR

In [3]:
print(data.isnull())

    Name    Age  Salary  Country  Gender  Department
0  False  False   False    False   False       False
1  False   True   False    False   False       False
2  False  False    True    False   False       False
3  False  False   False     True   False       False
4  False   True    True    False   False       False
5  False  False    True    False   False       False
6  False  False   False    False   False       False
7  False   True    True    False   False       False
8  False  False    True    False   False       False
9  False  False   False    False   False       False

In [4]:
print(data.isna())

    Name    Age  Salary  Country  Gender  Department
0  False  False   False    False   False       False
1  False   True   False    False   False       False
2  False  False    True    False   False       False
3  False  False   False     True   False       False
4  False   True    True    False   False       False
5  False  False    True    False   False       False
6  False  False   False    False   False       False
7  False   True    True    False   False       False
8  False  False    True    False   False       False
9  False  False   False    False   False       False

In [8]:
missing_values = data.isna().sum()#or use data.isnull().sum()
print(missing_values)

Name          0
Age           3
Salary        5
Country       1
Gender        0
Department    0
dtype: int64

In [9]:
missing=data2[data2.isnull().any(axis=1)]#axis=1 represents column
print(missing) #rows which has atlest one missing column values are listed

      Name   Age   Salary  Country  Gender Department
1      Bob   NaN  60000.0   Canada    Male         IT
2  Charlie  30.0      NaN      USA    Male    Finance
3    David  22.0  45000.0      NaN    Male         IT
4      Eva   NaN      NaN  Germany  Female         HR
5    Frank  35.0      NaN   Canada    Male         IT
7     Hank   NaN      NaN  Germany    Male         IT
8      Ivy  31.0      NaN  Germany  Female    Finance

In [10]:
missing.describe()

             Age        Salary
count   4.000000      2.000000
mean   29.500000  52500.000000
std     5.446712  10606.601718
min    22.000000  45000.000000
25%    28.000000  48750.000000
50%    30.500000  52500.000000
75%    32.000000  56250.000000
max    35.000000  60000.000000

In [11]:
#Since there is no much difference between mean and median we put mean value in place of NaN

data2["Age"].mean()

30.142857142857142

In [13]:
data2["Age"].fillna(data2["Age"].mean(),inplace=True)
print(data2)

      Name        Age   Salary  Country  Gender Department
0    Alice  25.000000  50000.0      USA  Female         HR
1      Bob  30.142857  60000.0   Canada    Male         IT
2  Charlie  30.000000      NaN      USA    Male    Finance
3    David  22.000000  45000.0      NaN    Male         IT
4      Eva  30.142857      NaN  Germany  Female         HR
5    Frank  35.000000      NaN   Canada    Male         IT
6    Grace  28.000000  55000.0      USA  Female    Finance
7     Hank  30.142857      NaN  Germany    Male         IT
8      Ivy  31.000000      NaN  Germany  Female    Finance
9     Jack  40.000000  80000.0      USA    Male         HR

C:\Users\raamp\AppData\Local\Temp\ipykernel_11644\3720776202.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data2["Age"].fillna(data2["Age"].mean(),inplace=True)

In [15]:
data2["Salary"].fillna(data2["Salary"].mean(),inplace=True)
print(data2)

      Name        Age   Salary  Country  Gender Department
0    Alice  25.000000  50000.0      USA  Female         HR
1      Bob  30.142857  60000.0   Canada    Male         IT
2  Charlie  30.000000  58000.0      USA    Male    Finance
3    David  22.000000  45000.0      NaN    Male         IT
4      Eva  30.142857  58000.0  Germany  Female         HR
5    Frank  35.000000  58000.0   Canada    Male         IT
6    Grace  28.000000  55000.0      USA  Female    Finance
7     Hank  30.142857  58000.0  Germany    Male         IT
8      Ivy  31.000000  58000.0  Germany  Female    Finance
9     Jack  40.000000  80000.0      USA    Male         HR

C:\Users\raamp\AppData\Local\Temp\ipykernel_11644\342178737.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data2["Salary"].fillna(data2["Salary"].mean(),inplace=True)

In [16]:
print(data)

      Name   Age   Salary  Country  Gender Department
0    Alice  25.0  50000.0      USA  Female         HR
1      Bob   NaN  60000.0   Canada    Male         IT
2  Charlie  30.0      NaN      USA    Male    Finance
3    David  22.0  45000.0      NaN    Male         IT
4      Eva   NaN      NaN  Germany  Female         HR
5    Frank  35.0      NaN   Canada    Male         IT
6    Grace  28.0  55000.0      USA  Female    Finance
7     Hank   NaN      NaN  Germany    Male         IT
8      Ivy  31.0      NaN  Germany  Female    Finance
9     Jack  40.0  80000.0      USA    Male         HR

In [18]:
#replace NaN with dtype as non numeric by value occured most frequently

data2["Country"].value_counts()

Country
USA        4
Germany    3
Canada     2
Name: count, dtype: int64

In [20]:
data2["Country"].value_counts().index[0]

'USA'

In [23]:
#now replace NaN with USA

data2["Country"] = data2["Country"].fillna(data2["Country"].value_counts().index[0])
print(data2)

      Name        Age   Salary  Country  Gender Department
0    Alice  25.000000  50000.0      USA  Female         HR
1      Bob  30.142857  60000.0   Canada    Male         IT
2  Charlie  30.000000  58000.0      USA    Male    Finance
3    David  22.000000  45000.0      USA    Male         IT
4      Eva  30.142857  58000.0  Germany  Female         HR
5    Frank  35.000000  58000.0   Canada    Male         IT
6    Grace  28.000000  55000.0      USA  Female    Finance
7     Hank  30.142857  58000.0  Germany    Male         IT
8      Ivy  31.000000  58000.0  Germany  Female    Finance
9     Jack  40.000000  80000.0      USA    Male         HR

In [25]:
data2.isnull().sum()

Name          0
Age           0
Salary        0
Country       0
Gender        0
Department    0
dtype: int64

In [26]:
print(data3)

      Name   Age   Salary  Country  Gender Department
0    Alice  25.0  50000.0      USA  Female         HR
1      Bob   NaN  60000.0   Canada    Male         IT
2  Charlie  30.0      NaN      USA    Male    Finance
3    David  22.0  45000.0      NaN    Male         IT
4      Eva   NaN      NaN  Germany  Female         HR
5    Frank  35.0      NaN   Canada    Male         IT
6    Grace  28.0  55000.0      USA  Female    Finance
7     Hank   NaN      NaN  Germany    Male         IT
8      Ivy  31.0      NaN  Germany  Female    Finance
9     Jack  40.0  80000.0      USA    Male         HR

In [28]:
#Filling all the values in a single line

data3=data3.apply(lambda x:x.fillna(x.mean()) if x.dtype=="float" else x.fillna(x.value_counts().index[0]))
print(data3)

      Name        Age   Salary  Country  Gender Department
0    Alice  25.000000  50000.0      USA  Female         HR
1      Bob  30.142857  60000.0   Canada    Male         IT
2  Charlie  30.000000  58000.0      USA    Male    Finance
3    David  22.000000  45000.0      USA    Male         IT
4      Eva  30.142857  58000.0  Germany  Female         HR
5    Frank  35.000000  58000.0   Canada    Male         IT
6    Grace  28.000000  55000.0      USA  Female    Finance
7     Hank  30.142857  58000.0  Germany    Male         IT
8      Ivy  31.000000  58000.0  Germany  Female    Finance
9     Jack  40.000000  80000.0      USA    Male         HR

In [29]:
data3.isnull().sum()

Name          0
Age           0
Salary        0
Country       0
Gender        0
Department    0
dtype: int64